0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.101 0 0);

boundaryField
{
    inlet
    {
		type        	turbulentDFSEMInlet;
        delta       	0.021;
        interpolateU	true;
        interpolateL	true;
        interpolateR	true;
        value       	uniform (0.101 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            noSlip;
    }
    lateralWall
    {
        type            noSlip;
    }
    freeSurface
    {
        type            slip;
    }
    farField
    {
		type			slip;
	}
}


// ************************************************************************* //
