0.orig/tracer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      tracer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet           
    {
        type			zeroGradient;
    }
    outlet          
    {
        type			zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    lateralWall
    {
        type            zeroGradient;
    }
    farField
    {
        type            zeroGradient;
    }
    freeSurface
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
